ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Lib/mc9s12zvh128.c
volatile BATIFSTR _BATIF;                                  /* BATS Interrupt Flag Register; 0x000006F3 */
volatile SCI0ACR2STR _SCI0ACR2;                            /* SCI 0 Alternative Control Register 2; 0x00000702 */
volatile SCI0CR2STR _SCI0CR2;                              /* SCI 0 Control Register 2; 0x00000703 */
volatile SCI0SR1STR _SCI0SR1;                              /* SCI 0 Status Register 1; 0x00000704 */
volatile SCI0SR2STR _SCI0SR2;                              /* SCI 0 Status Register 2; 0x00000705 */
volatile SCI0DRHSTR _SCI0DRH;                              /* SCI 0 Data Register High; 0x00000706 */
volatile SCI0DRLSTR _SCI0DRL;                              /* SCI 0 Data Register Low; 0x00000707 */
volatile SCI1ACR2STR _SCI1ACR2;                            /* SCI 1 Alternative Control Register 2; 0x00000712 */
volatile SCI1CR2STR _SCI1CR2;                              /* SCI 1 Control Register 2; 0x00000713 */
volatile SCI1SR1STR _SCI1SR1;                              /* SCI 1 Status Register 1; 0x00000714 */
volatile SCI1SR2STR _SCI1SR2;                              /* SCI 1 Status Register 2; 0x00000715 */
volatile SCI1DRHSTR _SCI1DRH;                              /* SCI 1 Data Register High; 0x00000716 */
volatile SCI1DRLSTR _SCI1DRL;                              /* SCI 1 Data Register Low; 0x00000717 */
volatile SPI0CR1STR _SPI0CR1;                              /* SPI 0 Control Register 1; 0x00000780 */
volatile SPI0CR2STR _SPI0CR2;                              /* SPI 0 Control Register 2; 0x00000781 */
volatile SPI0BRSTR _SPI0BR;                                /* SPI 0 Baud Rate Register; 0x00000782 */
volatile SPI0SRSTR _SPI0SR;                                /* SPI 0 Status Register; 0x00000783 */
volatile IIC0IBADSTR _IIC0IBAD;                            /* IIC Address Register; 0x000007C0 */
volatile IIC0IBFDSTR _IIC0IBFD;                            /* IIC Frequency Divider Register; 0x000007C1 */
volatile IIC0IBCRSTR _IIC0IBCR;                            /* IIC Control Register; 0x000007C2 */
volatile IIC0IBSRSTR _IIC0IBSR;                            /* IIC Status Register; 0x000007C3 */
volatile IIC0IBDRSTR _IIC0IBDR;                            /* IIC Data I/O Register; 0x000007C4 */
volatile IIC0IBCR2STR _IIC0IBCR2;                          /* IIC Control Register 2; 0x000007C5 */
volatile CAN0CTL0STR _CAN0CTL0;                            /* MSCAN0 Control 0 Register; 0x00000800 */
volatile CAN0CTL1STR _CAN0CTL1;                            /* MSCAN0 Control 1 Register; 0x00000801 */
volatile CAN0BTR0STR _CAN0BTR0;                            /* MSCAN0 Bus Timing Register 0; 0x00000802 */
volatile CAN0BTR1STR _CAN0BTR1;                            /* MSCAN0 Bus Timing Register 1; 0x00000803 */
volatile CAN0RFLGSTR _CAN0RFLG;                            /* MSCAN0 Receiver Flag Register; 0x00000804 */
volatile CAN0RIERSTR _CAN0RIER;                            /* MSCAN0 Receiver Interrupt Enable Register; 0x00000805 */
volatile CAN0TFLGSTR _CAN0TFLG;                            /* MSCAN0 Transmitter Flag Register; 0x00000806 */
volatile CAN0TIERSTR _CAN0TIER;                            /* MSCAN0 Transmitter Interrupt Enable Register; 0x00000807 */
volatile CAN0TARQSTR _CAN0TARQ;                            /* MSCAN0 Transmitter Message Abort Request; 0x00000808 */
volatile CAN0TAAKSTR _CAN0TAAK;                            /* MSCAN0 Transmitter Message Abort Acknowledge; 0x00000809 */
volatile CAN0TBSELSTR _CAN0TBSEL;                          /* MSCAN0 Transmit Buffer Selection; 0x0000080A */
volatile CAN0IDACSTR _CAN0IDAC;                            /* MSCAN0 Identifier Acceptance Control Register; 0x0000080B */
volatile CAN0MISCSTR _CAN0MISC;                            /* MSCAN0 Miscellaneous Register; 0x0000080D */
volatile CAN0RXERRSTR _CAN0RXERR;                          /* MSCAN0 Receive Error Counter Register; 0x0000080E */
volatile CAN0TXERRSTR _CAN0TXERR;                          /* MSCAN0 Transmit Error Counter Register; 0x0000080F */
volatile CAN0IDAR0STR _CAN0IDAR0;                          /* MSCAN0 Identifier Acceptance Register 0; 0x00000810 */
volatile CAN0IDAR1STR _CAN0IDAR1;                          /* MSCAN0 Identifier Acceptance Register 1; 0x00000811 */
volatile CAN0IDAR2STR _CAN0IDAR2;                          /* MSCAN0 Identifier Acceptance Register 2; 0x00000812 */
volatile CAN0IDAR3STR _CAN0IDAR3;                          /* MSCAN0 Identifier Acceptance Register 3; 0x00000813 */
volatile CAN0IDMR0STR _CAN0IDMR0;                          /* MSCAN0 Identifier Mask Register 0; 0x00000814 */
volatile CAN0IDMR1STR _CAN0IDMR1;                          /* MSCAN0 Identifier Mask Register 1; 0x00000815 */
volatile CAN0IDMR2STR _CAN0IDMR2;                          /* MSCAN0 Identifier Mask Register 2; 0x00000816 */
volatile CAN0IDMR3STR _CAN0IDMR3;                          /* MSCAN0 Identifier Mask Register 3; 0x00000817 */
volatile CAN0IDAR4STR _CAN0IDAR4;                          /* MSCAN0 Identifier Acceptance Register 4; 0x00000818 */
volatile CAN0IDAR5STR _CAN0IDAR5;                          /* MSCAN0 Identifier Acceptance Register 5; 0x00000819 */
volatile CAN0IDAR6STR _CAN0IDAR6;                          /* MSCAN0 Identifier Acceptance Register 6; 0x0000081A */
volatile CAN0IDAR7STR _CAN0IDAR7;                          /* MSCAN0 Identifier Acceptance Register 7; 0x0000081B */
volatile CAN0IDMR4STR _CAN0IDMR4;                          /* MSCAN0 Identifier Mask Register 4; 0x0000081C */
volatile CAN0IDMR5STR _CAN0IDMR5;                          /* MSCAN0 Identifier Mask Register 5; 0x0000081D */
volatile CAN0IDMR6STR _CAN0IDMR6;                          /* MSCAN0 Identifier Mask Register 6; 0x0000081E */
volatile CAN0IDMR7STR _CAN0IDMR7;                          /* MSCAN0 Identifier Mask Register 7; 0x0000081F */
volatile CAN0RXIDR0STR _CAN0RXIDR0;                        /* MSCAN0 Receive Identifier Register 0; 0x00000820 */
volatile CAN0RXIDR1STR _CAN0RXIDR1;                        /* MSCAN0 Receive Identifier Register 1; 0x00000821 */
volatile CAN0RXIDR2STR _CAN0RXIDR2;                        /* MSCAN0 Receive Identifier Register 2; 0x00000822 */
volatile CAN0RXIDR3STR _CAN0RXIDR3;                        /* MSCAN0 Receive Identifier Register 3; 0x00000823 */
volatile CAN0RXDSR0STR _CAN0RXDSR0;                        /* MSCAN0 Receive Data Segment Register 0; 0x00000824 */
volatile CAN0RXDSR1STR _CAN0RXDSR1;                        /* MSCAN0 Receive Data Segment Register 1; 0x00000825 */
volatile CAN0RXDSR2STR _CAN0RXDSR2;                        /* MSCAN0 Receive Data Segment Register 2; 0x00000826 */
volatile CAN0RXDSR3STR _CAN0RXDSR3;                        /* MSCAN0 Receive Data Segment Register 3; 0x00000827 */
volatile CAN0RXDSR4STR _CAN0RXDSR4;                        /* MSCAN0 Receive Data Segment Register 4; 0x00000828 */
volatile CAN0RXDSR5STR _CAN0RXDSR5;                        /* MSCAN0 Receive Data Segment Register 5; 0x00000829 */
volatile CAN0RXDSR6STR _CAN0RXDSR6;                        /* MSCAN0 Receive Data Segment Register 6; 0x0000082A */
volatile CAN0RXDSR7STR _CAN0RXDSR7;                        /* MSCAN0 Receive Data Segment Register 7; 0x0000082B */
volatile CAN0RXDLRSTR _CAN0RXDLR;                          /* MSCAN0 Receive Data Length Register; 0x0000082C */
volatile CAN0TXIDR0STR _CAN0TXIDR0;                        /* MSCAN0 Transmit Identifier Register 0; 0x00000830 */
volatile CAN0TXIDR1STR _CAN0TXIDR1;                        /* MSCAN0 Transmit Identifier Register 1; 0x00000831 */
volatile CAN0TXIDR2STR _CAN0TXIDR2;                        /* MSCAN0 Transmit Identifier Register 2; 0x00000832 */
volatile CAN0TXIDR3STR _CAN0TXIDR3;                        /* MSCAN0 Transmit Identifier Register 3; 0x00000833 */
volatile CAN0TXDSR0STR _CAN0TXDSR0;                        /* MSCAN0 Transmit Data Segment Register 0; 0x00000834 */
volatile CAN0TXDSR1STR _CAN0TXDSR1;                        /* MSCAN0 Transmit Data Segment Register 1; 0x00000835 */
volatile CAN0TXDSR2STR _CAN0TXDSR2;                        /* MSCAN0 Transmit Data Segment Register 2; 0x00000836 */
volatile CAN0TXDSR3STR _CAN0TXDSR3;                        /* MSCAN0 Transmit Data Segment Register 3; 0x00000837 */
volatile CAN0TXDSR4STR _CAN0TXDSR4;                        /* MSCAN0 Transmit Data Segment Register 4; 0x00000838 */
volatile CAN0TXDSR5STR _CAN0TXDSR5;                        /* MSCAN0 Transmit Data Segment Register 5; 0x00000839 */
volatile CAN0TXDSR6STR _CAN0TXDSR6;                        /* MSCAN0 Transmit Data Segment Register 6; 0x0000083A */
volatile CAN0TXDSR7STR _CAN0TXDSR7;                        /* MSCAN0 Transmit Data Segment Register 7; 0x0000083B */
volatile CAN0TXDLRSTR _CAN0TXDLR;                          /* MSCAN0 Transmit Data Length Register; 0x0000083C */
volatile CAN0TXTBPRSTR _CAN0TXTBPR;                        /* MSCAN0 Transmit Buffer Priority; 0x0000083D */
volatile CP0DRSTR _CP0DR;                                  /* Port CP Data Register; 0x00000990 */
volatile CP0CRSTR _CP0CR;                                  /* CAN Physical Layer Control Register; 0x00000991 */
volatile CP0SRSTR _CP0SR;                                  /* CAN Physical Layer Status Register; 0x00000993 */
volatile CP0IESTR _CP0IE;                                  /* CAN Physical Layer Interrupt Enable Register; 0x00000996 */
volatile CP0IFSTR _CP0IF;                                  /* CAN Physical Layer Interrupt Flag Register; 0x00000997 */
volatile LCDCR0STR _LCDCR0;                                /* LCD Control Register 0; 0x00000A00 */
volatile LCDCR1STR _LCDCR1;                                /* LCD Control Register 1; 0x00000A01 */
volatile LCDFPENR0STR _LCDFPENR0;                          /* LCD Frontplane Enable Register 0; 0x00000A02 */
volatile LCDFPENR1STR _LCDFPENR1;                          /* LCD Frontplane Enable Register 1; 0x00000A03 */
volatile LCDFPENR2STR _LCDFPENR2;                          /* LCD Frontplane Enable Register 2; 0x00000A04 */
volatile LCDFPENR3STR _LCDFPENR3;                          /* LCD Frontplane Enable Register 3; 0x00000A05 */
volatile LCDFPENR4STR _LCDFPENR4;                          /* LCD Frontplane Enable Register 4; 0x00000A06 */
volatile LCDRAM0STR _LCDRAM0;                              /* LCD RAM 0; 0x00000A08 */
volatile LCDRAM1STR _LCDRAM1;                              /* LCD RAM 1; 0x00000A09 */
volatile LCDRAM2STR _LCDRAM2;                              /* LCD RAM 2; 0x00000A0A */
volatile LCDRAM3STR _LCDRAM3;                              /* LCD RAM 3; 0x00000A0B */
volatile LCDRAM4STR _LCDRAM4;                              /* LCD RAM 4; 0x00000A0C */
volatile LCDRAM5STR _LCDRAM5;                              /* LCD RAM 5; 0x00000A0D */
volatile LCDRAM6STR _LCDRAM6;                              /* LCD RAM 6; 0x00000A0E */
volatile LCDRAM7STR _LCDRAM7;                              /* LCD RAM 7; 0x00000A0F */
volatile LCDRAM8STR _LCDRAM8;                              /* LCD RAM 8; 0x00000A10 */
volatile LCDRAM9STR _LCDRAM9;                              /* LCD RAM 9; 0x00000A11 */
volatile LCDRAM10STR _LCDRAM10;                            /* LCD RAM 10; 0x00000A12 */
volatile LCDRAM11STR _LCDRAM11;                            /* LCD RAM 11; 0x00000A13 */
volatile LCDRAM12STR _LCDRAM12;                            /* LCD RAM 12; 0x00000A14 */
volatile LCDRAM13STR _LCDRAM13;                            /* LCD RAM 13; 0x00000A15 */
volatile LCDRAM14STR _LCDRAM14;                            /* LCD RAM 14; 0x00000A16 */
volatile LCDRAM15STR _LCDRAM15;                            /* LCD RAM 15; 0x00000A17 */
volatile LCDRAM16STR _LCDRAM16;                            /* LCD RAM 16; 0x00000A18 */
volatile LCDRAM17STR _LCDRAM17;                            /* LCD RAM 17; 0x00000A19 */
volatile LCDRAM18STR _LCDRAM18;                            /* LCD RAM 18; 0x00000A1A */
volatile LCDRAM19STR _LCDRAM19;                            /* LCD RAM 19; 0x00000A1B */
volatile MCCTL0STR _MCCTL0;                                /* Motor Controller Control Register 0; 0x00000A40 */
volatile MCCTL1STR _MCCTL1;                                /* Motor Controller Control Register 1; 0x00000A41 */
volatile MCCC0STR _MCCC0;                                  /* Motor Controller Control Register 0; 0x00000A50 */
volatile MCCC1STR _MCCC1;                                  /* Motor Controller Control Register 1; 0x00000A51 */
volatile MCCC2STR _MCCC2;                                  /* Motor Controller Control Register 2; 0x00000A52 */
volatile MCCC3STR _MCCC3;                                  /* Motor Controller Control Register 3; 0x00000A53 */
volatile MCCC4STR _MCCC4;                                  /* Motor Controller Control Register 4; 0x00000A54 */
volatile MCCC5STR _MCCC5;                                  /* Motor Controller Control Register 5; 0x00000A55 */
volatile MCCC6STR _MCCC6;                                  /* Motor Controller Control Register 6; 0x00000A56 */
volatile MCCC7STR _MCCC7;                                  /* Motor Controller Control Register 7; 0x00000A57 */
volatile RTZ0CTLSTR _RTZ0CTL;                              /* SSD0 Return-to-Zero Control Register; 0x00000A80 */
volatile MDC0CTLSTR _MDC0CTL;                              /* SSD0 Modulus Down Counter Control Register; 0x00000A81 */
volatile SSD0CTLSTR _SSD0CTL;                              /* SSD0 Stepper Stall Detector Control Register; 0x00000A82 */
volatile SSD0FLGSTR _SSD0FLG;                              /* SSD0 Stepper Stall Detector Flag Register; 0x00000A83 */
volatile RTZ1CTLSTR _RTZ1CTL;                              /* SSD1 Return-to-Zero Control Register; 0x00000A90 */
volatile MDC1CTLSTR _MDC1CTL;                              /* SSD1 Modulus Down Counter Control Register; 0x00000A91 */
volatile SSD1CTLSTR _SSD1CTL;                              /* SSD1 Stepper Stall Detector Control Register; 0x00000A92 */
volatile SSD1FLGSTR _SSD1FLG;                              /* SSD1 Stepper Stall Detector Flag Register; 0x00000A93 */
volatile RTZ2CTLSTR _RTZ2CTL;                              /* SSD2 Return-to-Zero Control Register; 0x00000AA0 */
volatile MDC2CTLSTR _MDC2CTL;                              /* SSD2 Modulus Down Counter Control Register; 0x00000AA1 */
volatile SSD2CTLSTR _SSD2CTL;                              /* SSD2 Stepper Stall Detector Control Register; 0x00000AA2 */
volatile SSD2FLGSTR _SSD2FLG;                              /* SSD2 Stepper Stall Detector Flag Register; 0x00000AA3 */
volatile RTZ3CTLSTR _RTZ3CTL;                              /* SSD3 Return-to-Zero Control Register; 0x00000AB0 */
volatile MDC3CTLSTR _MDC3CTL;                              /* SSD3 Modulus Down Counter Control Register; 0x00000AB1 */
volatile SSD3CTLSTR _SSD3CTL;                              /* SSD3 Stepper Stall Detector Control Register; 0x00000AB2 */
volatile SSD3FLGSTR _SSD3FLG;                              /* SSD3 Stepper Stall Detector Flag Register; 0x00000AB3 */
volatile RTCCTL1STR _RTCCTL1;                              /* RTC Control Register 1; 0x00000AE0 */
volatile RTCCTL2STR _RTCCTL2;                              /* RTC Control Register 2; 0x00000AE1 */
volatile RTCCTL3STR _RTCCTL3;                              /* RTC Control Register 3; 0x00000AE2 */
volatile RTCCTL4STR _RTCCTL4;                              /* RTC Control Register 4; 0x00000AE3 */
volatile RTCS1STR _RTCS1;                                  /* RTC Status Register 1; 0x00000AE4 */
volatile RTCCCRSTR _RTCCCR;                                /* RTC Compensation Configure Register; 0x00000AE5 */
volatile RTCSECRSTR _RTCSECR;                              /* Second Register; 0x00000AED */
volatile RTCMINRSTR _RTCMINR;                              /* Minute Register; 0x00000AEE */
volatile RTCHRRSTR _RTCHRR;                                /* Hour Register; 0x00000AEF */
volatile SSG0CRSTR _SSG0CR;                                /* SSG Control Register; 0x00000B00 */
volatile SSG0ADCSTR _SSG0ADC;                              /* SSG attack/decay control register; 0x00000B01 */
volatile SSG0DURSTR _SSG0DUR;                              /* SSG Tone Duration register; 0x00000B0C */
volatile SSG0IESTR _SSG0IE;                                /* SSG Interrupt Enable; 0x00000B0D */
volatile SSG0IFSTR _SSG0IF;                                /* SSG Interrupt Flag Registers; 0x00000B0E */
volatile SSG0DCNTSTR _SSG0DCNT;                            /* SSG Tone Duration Counter; 0x00000B12 */
/* NVFPROT - macro for reading non volatile register       Non Volatile P-Flash Protection Register; 0x00FFFE0C */
/* Tip for register initialization in the user code:  const byte NVFPROT_INIT @0x00FFFE0C = <NVFPROT_INITVAL>; */
/* NVDFPROT - macro for reading non volatile register      Non Volatile D-Flash Protection Register; 0x00FFFE0D */
/* Tip for register initialization in the user code:  const byte NVDFPROT_INIT @0x00FFFE0D = <NVDFPROT_INITVAL>; */
/* NVFOPT - macro for reading non volatile register        Non Volatile Flash Option Register; 0x00FFFE0E */
/* Tip for register initialization in the user code:  const byte NVFOPT_INIT @0x00FFFE0E = <NVFOPT_INITVAL>; */
/* NVFSEC - macro for reading non volatile register        Non Volatile Flash Security Register; 0x00FFFE0F */
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x00FFFE0F = <NVFSEC_INITVAL>; */


